//         ..........*..                                    
//        ........*,@@@@@\`.                                       
//        ......]@@@@@@@@@@@\`..                                  
//        ..../@@@@@@@@@@[[[@@@@@]]`...                                    
// ........./@@@@@@@@@*.... ..... ..,\\.                               
// .......,@@@@@@@@@/.......       ....@.                               
// ....../@@@@@@@@@@........           .@*.                                
// ....,@@@@@@/=@@@^.......            ..@*                              
// ...=@@//@@@.@@@@.......................@                           
// ......*@@@@.@@@`. ..    ...........]...=^                           
// ......=@@@^.....,]]/@@*...=/[`.....@....\                           
// ......@@@@^..=`.....,/.....[[@@@@/`.....@                           
// .....=@@@/\...,[[[[[............,OOOO^..@                           
// .....@@@\@@..oOOO^.....]@@@@@@\].......=^                          
// ......,@`.=^......]/@OOOOOOOOOOOOO@@\.,/                 
// ....,/.....=\...=@OOOOOOOOOOOOOOOOO@@@`                
// .../^..=^..,[[@]*,[\@@@OOOOOOOOO@/]@`                   
// ..=^....=^.......[[@@/[@@@@OOOOO^.               
// .,/..\@..\`.   ....=^..=@@@@@OO@^.                     
// ./....=...@.   .....@...@@@@@OO@^                 
// .@....=^..=\..... ..=^.
// .^.....^...\`...    .\`
// .@.... @    @*..    ..=\.  
// .\.... @    .\..    ....\`.   
// .,\....@    .=^.        .=^.   
// ..\` ..@    .=^.        ..^.    
// ...\`,/^    .=@.....    .=^.                                            
// ..]@[...    ./[\....    ./.                                           
// ..\\]........@./`......./`                                      
// ....=\..,/^,/....]]]]@[.                                     
//        ....\@\]//=@O@.                                      
//        ....@OOO^.,@O@@@@@@@@]]                                      
// ..........=@OO@@@@@@@@@@@@OOOOO@`                                   
// ...../@OOOOOO@@OOOOOOOOOOO@@@@@/                                 
// ....,@@@@@[\@@@@@@OOOOOOOOO@..                             
// ....................................                                                             


/**
 * 主入口配置
 * lingdu 2020-07-21
 * 全局配置在这里，如果比较懒的话，就在这里配置一大堆文件
 * 配置了就随便用，但是出问题也不会很好解决
 * 如果想使用env文件对全局变量进行设置
 * 注意vuecli2和vuecli3有根本性的区别
 * cli2使用相关的config/内pro.dev.js文件，cli3则使用.env/.env.development/.env.production文件
 * 不知道为什么cli3非要增加VUE_APP_作为前缀，这样刻意标榜不好
 */

import Vue from 'vue'
import store from './store'
import Router from './router'
import App from './App.vue'
import './plugins/ant-design-vue.js'

// permission control @ 等价于 /src 这个目录，避免写麻烦又易错的相对路径
import '@/router/permission' 

Vue.use(Router)
Vue.config.productionTip = false


new Vue({
  router:Router,
  store:store,
  render: h => h(App),
}).$mount('#app')
